// const arrNumbers = [1, 4, 22, 16, 21, 7, 19, 11, 99];
// arrNumbers.forEach((number) => {
//     if (number % 2 === 0) {
//          console.log(number * 4);
//     }
   
// });
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////Створити масив рядків - вивести методом map у консоль кожно строку, а поруч - її довжину
// Створити масив рядків - вивести методом map у консоль кожно строку, а поруч - її довжину
// const arrStrings = ["JS", "React", "STB", "apple", "peach", "carrot", "mouse"]
// arrStrings.map((str) => {
//     console.log(str.length, str);
// });
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Створити масив чисел - та вивести у консоль створений за допомогою методу filter масив чисел , у якому числа більше 10
// const arrNumbers = [1, 4, 22, 16, 21, 7, 19, 11, 99];
// let newArr = arrNumbers.filter((number) => number > 10
// )
// console.log(newArr);
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Створити масив рядків - відфільтрувати їх та свторити новий масив методом filter куди війдуть тільки ті рядки, довжина яких більше 5

// const arrStrings = ["JS", "React", "STB", "apple", "peaches", "carrot", "mouse"];
// let newArr = arrStrings.filter((str) => str.length > 5)
// console.log(newArr);
///////////////////////////

// Створити масив булеан, строк та чисел - методом filter свторити новий масив який буде містити тільки числа\
// const newArr = [12, "peach", true, 33, false, "apple"];
// let arrNumbers = newArr.filter((numbers) => {
//     if (typeof (numbers) === "number") {
//         console.log(numbers);
//         return numbers;

//     }
// });
// console.log(arrNumbers);
///////////////////////////////////////////////
// Створити масив об'єктів та вивести у консоль тільки ті значення поля name юзерів вік яких більше за 20.



// let users = [
//     {
//         name: 'Anya',
//         age: 21,
//     },
//     {
//         name: 'Masha',
//         age: 19,
//     },
//     {
//         name: 'Dasha',
//         age: 18,
//     },
//     {
//         name: 'Melisa',
//         age: 22,
//     },
//     {
//         name: 'Krisstina',
//         age: 27,
//     },
//     {
//         name: 'Yulya',
//         age: 19,
//     },
// ];
// users.forEach(({age, name}) => {
//     if (age > 20) console.log(name);
// });
// Створити масив чисел  - створити з нього новий масив який буде скадатись з чисел які діляться на 3 та на 2 без остачі
// const arrNumbers = [1, 4, 22, 36, 21, 7, 18, 11, 99];
// let newNumber = arrNumbers.filter(numbers => numbers % 3 === 0 && numbers % 2 === 0);
// console.log(newNumber);